<a href="https://colab.research.google.com/github/vjbarayuga/Week2-Pandas-for-Data-Manipulation-CodingDojo/blob/main/TitanicDatasetAnalysis.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

In [2]:
# 1 Display the head of the dataframe
import pandas as pd
# Keep in mind that the filename will likely be different on your computer (especially later in course)
filename='/content/drive/MyDrive/Coding_DOJO-Data_Science_Bootcamp/02_Part_Time_Data_Science/2_Pandas_for_Data_Manipulation/Dataset/titanic.csv'
df = pd.read_csv(filename)
df

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0              1         0       3  ...   7.2500   NaN         S
1              2         1       1  ...  71.2833   C85         C
2              3         1       3  ...   7.9250   NaN         S
3              4         1       1  ...  53.1000  C123         S
4              5         0       3  ...   8.0500   NaN         S
..           ...       ...     ...  ...      ...   ...       ...
886          887         0       2  ...  13.0000   NaN         S
887          888         1       1  ...  30.0000   B42         S
888          889         0       3  ...  23.4500   NaN         S
889          890         1       1  ...  30.0000  C148         C
890          891         0       3  ...   7.7500   NaN         Q

[891 rows x 12 columns]

In [5]:
df.Name.describe()

count                 891
unique                891
top       Calic, Mr. Jovo
freq                    1
Name: Name, dtype: object

In [6]:
df.sort_values('Name')

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
845          846         0       3  ...   7.5500   NaN         S
746          747         0       3  ...  20.2500   NaN         S
279          280         1       3  ...  20.2500   NaN         S
308          309         0       2  ...  24.0000   NaN         C
874          875         1       2  ...  24.0000   NaN         C
..           ...       ...     ...  ...      ...   ...       ...
286          287         1       3  ...   9.5000   NaN         S
282          283         0       3  ...   9.5000   NaN         S
361          362         0       2  ...  27.7208   NaN         C
153          154         0       3  ...  14.5000   NaN         S
868          869         0       3  ...   9.5000   NaN         S

[891 rows x 12 columns]

In [7]:
# drop useless columns
#df.drop('Name', axis=1, inplace=True)
#df.drop('Cabin', axis=1, inplace=True)
#df.drop('Ticket', axis=1, inplace=True)

# no need for the following as the sum is used
#df.drop('Parch', axis=1, inplace=True)
#df.drop('SibSp', axis=1, inplace=True)

In [9]:
survivedF = df.loc[:, 'Survived'] == 1

In [10]:
df.loc[survivedF, 'Sex'].value_counts(dropna = False)

female    233
male      109
Name: Sex, dtype: int64

In [9]:
# 2 Percentage of people who survived
df['Survived'].mean()

0.3838383838383838

In [12]:
# 3 How many of each sex survived
#df[['Sex', 'Survived']].groupby(['Sex'], as_index = False).mean()
#df.loc[survived, :].groupby('Sex')['Survived'].count()
survivedF = df.loc[:, 'Survived'] == 1

In [13]:
#show survived
df.loc[survivedF, :].head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
8            9         1       3  ...  11.1333   NaN         S
9           10         1       2  ...  30.0708   NaN         C

[5 rows x 12 columns]

In [15]:
df.loc[survivedF, 'Sex'].value_counts(dropna = False)

female    233
male      109
Name: Sex, dtype: int64

In [17]:
# 4 Group of passengers who paid less than $10
#df["Fare"] < 10
fareF = df.loc[:, 'Fare'] < 10

In [18]:
df.loc[survivedF & fareF].head()

    PassengerId  Survived  Pclass  ...    Fare Cabin  Embarked
2             3         1       3  ...  7.9250   NaN         S
19           20         1       3  ...  7.2250   NaN         C
22           23         1       3  ...  8.0292   NaN         Q
28           29         1       3  ...  7.8792   NaN         Q
32           33         1       3  ...  7.7500   NaN         Q

[5 rows x 12 columns]

In [19]:
#length of remaining df
len(df.loc[survivedF & fareF, :]) / len(df.loc[survivedF, :])

0.195906432748538

In [22]:
# 5 Average age not survived
df.loc[~survivedF, 'Age'].mean()

30.62617924528302

In [23]:
# 6 Average age survived
df.loc[survivedF, 'Age'].mean()

28.343689655172415

In [17]:
# 7 Average age of those who did and did not survive grouped by sex

age_survived = survived_data.groupby(by=['Sex'])[['Age']].mean()
age_survived

              Age
Sex
female  28.847716
male    27.276022

In [18]:
# 7 Average age of those who did and did not survive grouped by sex
age_survived = did_not_survived_data.groupby(by=['Sex'])[['Age']].mean()
age_survived

              Age
Sex
female  25.046875
male    31.618056

In [25]:
#other method
df.groupby(['Sex', 'Survived'])[['Age']].mean()

                       Age
Sex    Survived
female 0         25.046875
       1         28.847716
male   0         31.618056
       1         27.276022

In [24]:

#PRACTICE CODE
#Overall average age of those who survived and did not survive
#df_new = df['Survived']
#df_new = df.loc[df_new, :]
#df_new = df['Survived'].value_counts(dropna = False)
#df_new
df_new = df['Survived']
df_new = df.loc[df_new, :]
survived = df['Survived'].value_counts(dropna = False)
survived

0    549
1    342
Name: Survived, dtype: int64

In [15]:
#PRACTICE CODE
#Overall average age of those who survived
#Overall average age of those who did not survive
#survived = df[df['Survived'] == 1]
#died = df[df['Survived'] == 0]
#print('Analysis of Survival')
#print('{0} survived the wreck'.format(survived.shape[0]))
#print('{0} did not survive the wreck'.format(died.shape[0]))
#survived_percent = round(((float(len(survived)/len(df))) * 100), 2)
#died_percent = round(((float(len(died)/len(df))) * 100), 2)
#print('Survival Percentage = {0} %'.format(survived_percent))
#print('Death Percentage = {0} %'.format(died_percent))

In [16]:
#PRACTICE CODE
#df[["Sex", "Age"]].groupby("Sex").mean()

In [17]:
#df[['Sex', 'Survived']].groupby(['Sex'], as_index = False).mean()

In [18]:
#PRACTICE CODE
#df[["Sex", "Age","Survived"]].groupby("Sex").mean()

In [19]:
#PRACTICE CODE
#df.groupby('Sex').agg({'Age':'mean'})